In [1]:
import pandas as pd
from pandas import DataFrame

In [2]:
d = {}
e={}
f = {}
for year in range(2007, 2018):
#     print(year)
    data = pd.read_csv("mls-salaries-{0}.csv".format(year))
    df = DataFrame(data, columns=["guaranteed_compensation"])
    df["guaranteed_compensation"] = df["guaranteed_compensation"].fillna(0).astype(int)
    df = df.assign(year=year)
    df = df.reindex_axis(["year","guaranteed_compensation"], axis=1)
    group = df.groupby("year", as_index=False).mean()
    median = df.groupby("year", as_index=False).median()
    total = df.groupby("year", as_index=False).sum()
    print(group)
    d[year] = group.guaranteed_compensation
    e[year] = median.guaranteed_compensation
    f[year] = total.guaranteed_compensation
    
    
print(f)

   year  guaranteed_compensation
0  2007            113810.377358
   year  guaranteed_compensation
0  2008            115066.880779
   year  guaranteed_compensation
0  2009            133706.257732
   year  guaranteed_compensation
0  2010            173491.360097
   year  guaranteed_compensation
0  2011            162056.085714
   year  guaranteed_compensation
0  2012            179165.768953
   year  guaranteed_compensation
0  2013            165066.130208
   year  guaranteed_compensation
0  2014            226454.174825
   year  guaranteed_compensation
0  2015            291933.273519
   year  guaranteed_compensation
0  2016            316777.245045
   year  guaranteed_compensation
0  2017            326139.131494
{2016: 0    175811371
Name: guaranteed_compensation, dtype: int64, 2017: 0    200901705
Name: guaranteed_compensation, dtype: int64, 2007: 0    42223650
Name: guaranteed_compensation, dtype: int64, 2008: 0    47292488
Name: guaranteed_compensation, dtype: int64, 2009: 0    51878028
Name: guaranteed_compensation, dtype: int64, 2010: 0    71304949
Name: guaranteed_compensation, dtype: int64, 2011: 0    85079445
Name: guaranteed_compensation, dtype: int64, 2012: 0    99257836
Name: guaranteed_compensation, dtype: int64, 2013: 0    95078091
Name: guaranteed_compensation, dtype: int64, 2014: 0    129531788
Name: guaranteed_compensation, dtype: int64, 2015: 0    167569699
Name: guaranteed_compensation, dtype: int64}

In [3]:
table = DataFrame.from_dict(d, orient="index").reset_index()

In [4]:
table_median = DataFrame.from_dict(e, orient="index").reset_index()

In [5]:
table_total = DataFrame.from_dict(f, orient="index").reset_index()

In [6]:
table_total

    index          0
0    2007   42223650
1    2008   47292488
2    2009   51878028
3    2010   71304949
4    2011   85079445
5    2012   99257836
6    2013   95078091
7    2014  129531788
8    2015  167569699
9    2016  175811371
10   2017  200901705

In [7]:
table = table.rename(columns={'index': 'year', 0:"average"}).round(0).astype(int)
table_median = table_median.rename(columns = {"index":"year", 0:"median"})
table_total = table_total.rename(columns = {"index":"year", 0:"total"})

In [8]:
table_total

    year      total
0   2007   42223650
1   2008   47292488
2   2009   51878028
3   2010   71304949
4   2011   85079445
5   2012   99257836
6   2013   95078091
7   2014  129531788
8   2015  167569699
9   2016  175811371
10  2017  200901705

In [9]:
join = pd.merge(pd.merge(table, table_median, on='year'), table_total, on='year')

In [10]:
join

    year  average    median      total
0   2007   113810   50400.0   42223650
1   2008   115067   56988.0   47292488
2   2009   133706   76043.5   51878028
3   2010   173491   92375.0   71304949
4   2011   162056   79764.0   85079445
5   2012   179166   84770.5   99257836
6   2013   165066   87333.0   95078091
7   2014   226454   92000.0  129531788
8   2015   291933  112000.0  167569699
9   2016   316777  117000.0  175811371
10  2017   326139  135002.0  200901705

In [11]:
join.to_csv("salaries.csv", index = False)